IDEA StatiCa Open Model
NonConformity.Severity Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 severity of this nonconformity
 Namespace: IdeaRS.OpenModel.Message
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public NonConformitySeverity Severity { get; set; }
Public Property Severity As NonConformitySeverity
	Get
	Set
public:
property NonConformitySeverity Severity {
	NonConformitySeverity get ();
	void set (NonConformitySeverity value);
}
Property Value
Type: NonConformitySeverity
See Also
Reference
NonConformity Class
IdeaRS.OpenModel.Message Namespace